src/cf/InformationRegisters/ПодпискиПолучателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>ПодпискиПолучателей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>КаналСообщений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСообщениями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПодпискиПолучателей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Определяет конечные точки (подписчиков) для широковещательного канала
// типа "Публикация/Подписка".
//
// Параметры:
//  КаналСообщений - Строка - Идентификатор широковещательного канала сообщений.
//
// Возвращаемое значение:
//  Массив - Массив элементов конечных точек, содержит элементы типа ПланОбменаСсылка.ОбменСообщениями.
//
Функция ПодписчикиКаналаСообщений(Знач КаналСообщений) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПодпискиПолучателей.Получатель КАК Получатель
	|ИЗ
	|	РегистрСведений.ПодпискиПолучателей КАК ПодпискиПолучателей
	|ГДЕ
	|	ПодпискиПолучателей.КаналСообщений = &КаналСообщений";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КаналСообщений", КаналСообщений);
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Получатель");
КонецФункции

#КонецОбласти

#КонецЕсли
